//! #TASK1: ციკლის საშუალებით გამოიტანეთ რიცხვები 5დან - 100მდე

//* -- Method 1 for loop
for(let i = 5; i <= 100; i++) {
    console.log(i)
}

//* -- Method 2 while loop
let num = 5;

while(num <= 100) {
    console.log(num)
    num++ //5+1 
}

//! #TASK2.მოცემულია მასივი: let array1= [1, 2, 4, -1, -3, 8, 7, 0, -5, 18, 12];
//! ციკლის საშუალებით გამოიტანეთ მხოლოდ ის რიცხვები რომლებიც მეტია 0 ზე და 	ნაკლებია 10ზე

let array1= [1, 2, 4, -1, -3, 8, 7, 0, -5, 18, 12]; 

//* -- filter მეთოდი ქმნის ახალ მასივს array1 ყველა ელემენტით, (&&ოპერატორი_თუ ორივე პირობა არის True გადაიტანს arrayFilter მასივში
let arrayFilter = array1.filter(number => number > 0 && number < 10);  
console.log(arrayFilter) //^-- გაფილტრული მასივი: [ 1, 2, 4, 8, 7 ]


//! #TASK3:მოცემულია მასივი let array3= [1, 2, 3, 4, 5]; ციკლის საშუალებით გამოთვალეთ რიცხვების ჯამი
